TP_Patrones_Creacionales/README.md
@startuml
' --- Configuración Visual ---
skinparam classAttributeIconSize 0
skinparam packageStyle rectangle
hide emptyMembers
left to right direction

' --- Paquete: Singleton (Req 3) ---
package com.tp.config {
  class GestorConfiguracion <<Singleton>> {
    - static final GestorConfiguracion : instancia
    - String urlBd
    - String userBd
    - String pathReportes
    - GestorConfiguracion()
    + static GestorConfiguracion getInstancia()
    + String getPathReportes()
  }
}

' --- Paquete: Builder (Req 2) ---
package com.tp.reporte {
  class Reporte {
    - final String titulo
    - final String cuerpoPrincipal
    - final String encabezado
    - final String pieDePagina
    - final LocalDate fecha
    - final String autor
    - final Orientacion orientacion
    - Reporte(ReporteBuilder builder)
    + String getTitulo()
  }

  class Reporte.ReporteBuilder <<Builder>> {
    - final String titulo
    - final String cuerpoPrincipal
    - String encabezado
    - String pieDePagina
    - LocalDate fecha
    - String autor
    - Orientacion orientacion
    + ReporteBuilder(String titulo, String cuerpoPrincipal)
    + ReporteBuilder conEncabezado(String)
    + ReporteBuilder conPieDePagina(String)
    + ReporteBuilder conFecha(LocalDate)
    + ReporteBuilder conAutor(String)
    + ReporteBuilder conOrientacion(Orientacion)
    + Reporte build()
  }

  enum Orientacion {
    VERTICAL
    HORIZONTAL
  }

  ' Relaciones del Builder
  Reporte +-- Reporte.ReporteBuilder
  Reporte.ReporteBuilder ..> Reporte : "construye"
  Reporte *-- Orientacion
}


' --- Paquete: Factory (Req 1) ---
package com.tp.renderizado {
  interface IRenderizador {
    + void renderizar(Reporte reporte)
  }

  class RenderizadorPDF {
    + void renderizar(Reporte reporte)
  }
  class RenderizadorExcel {
    + void renderizar(Reporte reporte)
  }
  class RenderizadorCSV {
    + void renderizar(Reporte reporte)
  }

  class RenderizadorFactory <<Factory>> {
    + static IRenderizador crearRenderizador(String tipo)
  }

  ' Relaciones del Factory
  IRenderizador <|.. RenderizadorPDF
  IRenderizador <|.. RenderizadorExcel
  IRenderizador <|.. RenderizadorCSV

  RenderizadorFactory ..> IRenderizador : "crea"
  IRenderizador ..> Reporte : "usa"
}


' --- Paquete: Principal (Cliente) ---
package com.tp {
  class Main {
    + static void main(String[] args)
  }
}

' --- Relaciones entre Paquetes (Cliente) ---
Main ..> GestorConfiguracion : "usa (getInstancia)"
Main ..> Reporte.ReporteBuilder : "usa (build)"
Main ..> RenderizadorFactory : "usa (crear)"
Main ..> IRenderizador : "usa (renderizar)"

@enduml
